{
    "posts": [
        {
            "id": 1,
            "title": "\"A.I.M.E.E.\" is live!",
            "date": "2019-10-10",
            "image": "aimee-book-cover.png",
            "content": "<p>I am enormously satisfied to announce that <u>A.I.M.E.E.</u> is now available for sale in both print and eBook format through Amazon worldwide! US link below:</p>
            <p><a href='https: //www.amazon.com/I-M-Artificial-Intelligence-Enhanced-Exploration-ebook/dp/B07YQC9V62' target=_blank>A.I.M.E.E. Amazon Link</a></p>
            <p>I tried something new this time (aside from designing the cover completely on my own--yes there's a hidden message encoded in binary for those humans, or machines, who can translate it!)--Kindle MatchBook, a program that allows purchasers of the print/paperback edition to purchase a Kindle eBook edition free of charge. (Normal prices are $15 for the paperback and $2.99 for the eBook).</p>
            <p>The story deals with space exploration, contact with an extraterrestrial civilization, and especially Artificial Intelligence!--but it also asks a lot of philosophical and theological questions about belief, unbelief, the nature of consciousness and humanity, and whether a machine can ever be alive. It also features a Muslim hero and seeks to counter the toxic and blatantly false Islamophobic narrative often peddled in the West.</p>
            <p>I hope there's something in this story for everyone, and I tremendously enjoyed writing it. I hope you enjoy reading it!</p>",
            "categories": [
                "writing"
            ]
        },
        {
            "id": 2,
            "title": "Final A.I.M.E.E. blurb (maybe)",
            "date": "2019-09-27",
            "image": "",
            "content": "<p>I think I've come up with my final blurb for <u>A.I.M.E.E.</u>, my first Science Fiction novel. Here goes:</p>
            <p>It's 2647, or 144 as humans count time in the Interstellar Colonization Era. Ray Harris is a man with no attachments. The son of poor Martian parents, Ray made his escape freelancing as an interstellar star ship pilot, taking exploration and salvage missions others didn't want. The problem is, he's wasting away from a pair of chronic illnesses. There's a treatment, but only the super-rich can afford it. Ray figures he has one good mission left in him before his health forces him into early retirement and hospice care.</p>
            <p>Aimee Sultan is a deeply religious woman living in an age of skepticism. She's also the first sentient machine in the history of humanity. She was 'born' in 2396, when humanity launched the most ambitious interstellar mission in its history: IE32, a generation star ship bound for the one place beyond earth that might harbor life. However, just before Aimee and her human family reached their destination 44 light years from earth, they vanished without a trace. Multiple follow-up missions to investigate IE32's disappearance likewise vanished, in what's become known as the Bermuda Triangle in Space.</p>
            <p>Stranded on a distant planet, Aimee wonders if humanity will ever learn her story, or if we'll even accept her—AI is highly feared and regulated, and 'living' machines like Aimee aren't supposed to exist. Meanwhile, Ray's last mission puts him directly into harm's way, and on a collision course with Aimee's last known destination, where something waits that could threaten the survival of all humanity.</p>",
            "categories": [
                "writing"
            ]
        },
        {
            "id": 3,
            "title": "JavaScript, Python, and Databases!",
            "date": "2019-03-28",
            "image": "chat-getting-closer-2019-03-22-overlap-fixed-iphone.png",
            "content": "<p>I haven't posted in a while, and the reason for that is simple: my days have been consumed with Computer Science coursework! This semester, I'm taking 2 Master's level classes, for a total of 8 graduate credits, through Harvard Extension School. I'm not going to lie...it's grueling.</p>
            <p>The above screenshot, which is rather tongue-in-cheek, is from a test I did of a chat application I wrote using Flask-SocketIO and JavaScript. I had temporarily opened up my development server to my home network, and connected to it with my trusty iPhone. (Hence 'mobile kev', on the iPhone, chatting with 'Kevin' on my Desktop computer). And my 'monologue' with myself is accurate--I do hate CSS, but I'm determined to learn to like it, or at least to get along with it. 😉</p>            
            <p>This semester I'm studying the MEAN Stack--MongoDB (and the Mongoose Node.js module), Express, Angular, and Node--in one class...and Python3, Flask, Django, SQLite3, and PostgreSQL--in the other.</p>            
            <p>Node.js and the 2 Python web server options I'm working with, Flask and Django, are very different, with Node being pretty agnostic about everything, and extremely modular, and either Python option being extremely opinionated and taking a lot of server-side design decisions out of my hands. I think the initial learning curve to set up a functioning web server with Node (and Express! I wouldn't want to set up a Node server without all of the goodies Express brings into the equation) is higher than doing the same thing with Flask, but in the long run Node offers far more flexibility. And, with a Node-based web server, you've got JavaScript running server-side, and JavaScript running client-side: seems like an easier move between front-end, back-end, and full-stack web development. That having been said, Python is a pretty cool programming language in its own right, and I'm glad to have gotten exposure to it!</p>            
            <p>The server frameworks and the programming languages they're written in are only part of the puzzle, though, because of course then you add in templating engines to dynamically generate web pages (it's 2019, who serves static HTML pages anymore? Really!), and that's another bit to learn. Flask forces Jinja2 on the user, which is itself based on (but different from) Django's built-in templating engine. For continuity's sake (and because I've grown to like it), I found a JavaScript port of Jinja2, Nunjucks, that I've been using on my Node-based web apps.</p>            
            <p>Then there are the databases! SQL databases in their various flavors were just about the only way I conceived of 'data'...until I was introduced to MongoDB, a NoSQL database. Why is it called 'NoSQL'? Well, unlike SQLite3 and PostgreSQL, which organize data into tables, with increasingly complex relationships with other tables, and more and more 'foreign keys' to tie them together the bigger your app grows, MongoDB looks like, well, JSON, which is safe and familiar to any web developer. Even writing web apps in Python, I still use JSON for my API routes to easily exchange data with client-side JavaScript. A NoSQL database doesn't divide data into tables with their relationships and foreign keys. No, it lets you structure your data pretty much however you want, and since JSON is such a fact of life on the web, its queries look a lot more intuitive and easier to understand than SQL queries. (MongoDB doesn't actually use JSON, it uses BSON, but syntactically it looks very much like JSON).</p>            
            <p>All this is to say, I've been really busy with my studies! The good news is, I'm learning a lot, and I enjoy it! I've always liked computers and technology, but 'looking under the hood' of so many web technologies has been enlightening and fun. Hopefully it'll even lead to a new career writing software and making cool apps! Probably for the web at first, but I may move into mobile or even Desktop app writing in the future...why not?</p>            
            <p>So that's what I've been up to. If you don't hear from me for a while, trust that my nose is buried inside of a code editor, and I'm writing some application or other in either JavaScript, Python, or a combination of both!</p>",
            "categories": [
                "school",
                "programming"
            ]
        }
    ],
    "comments": [
        {
            "id": 1,
            "commenter": "Kevin Reinholz",
            "date": "2019-11-16",
            "body": "This chat app would've been so much easier with a Vue.js, React, or Angular front-end instead of vanilla JavaScript!",
            "postId": 3
        }
    ],
    "profile": {
        "name": "typicode"
    }
}
